applications/solvers/hybridPorousInterFoam_zy/CCR_template/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ====================transport=======================
Da1              [0 2 -1 0 0 0 0] 5e-9;    //water  5e-9   1e-6
Da2              [0 2 -1 0 0 0 0] 5e-9;    //air
Ha               [0 0 0 0 0 0 0] 0.5;      //1.0 = rho_water/rho_gas;
Ceq              [0 0 0 0 0 0 0] 0.0;

r_si             [0 1 -1 0 0 0 0] 0.005;
rho_si           [1 -3 0 0 0 0 0] 2165;
gama_si          [0 0 0 0 0 0 0] 1.3730;
gama_g          [0 0 0 0 0 0 0] -0.6036;
gama_l          [0 0 0 0 0 0 0] -0.7693;
// ====================================================

phases (wetting nonWetting);

nonWetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5;
    rho             [1 -3 0 0 0 0 0] 50;   
}

wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6; 
    rho             [1 -3 0 0 0 0 0] 1000;
}

//sigma            [1 0 -2 0 0 0 0]  0.077;


sigma            [1 0 -2 0 0 0 0]  1e-4; //0.0;

activateCapillarity            0;
activatePorousContactAngle     1;
SmoothingCycles		       1;
theta0 			      45;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

/*
relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 3;
}
*/

relativePermeabilityModel  BrooksAndCorey;
capillarityModel           BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 3;
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    alpha 0.5;	
}
