applications/solvers/hybridPorousInterFoam_zy/CCR_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.wetting.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2; 
        cAlpha          2;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
	//maxIter         10000;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    p
    {
        solver          GAMG; //PCG; //GAMG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
        maxIter          100;
	smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
	maxIter         10000;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    C     //Transport
    {
        solver          PBiCGStab;
        preconditioner  none;    //DILU;
        tolerance       1e-06;
        relTol          0;
        // smoother nnn;
    }
    CFinal
    {
        $C;
        tolerance       1e-07;
        relTol          0;
        // smoother nnn;
    }

    eps_si
    {
        solver          PBiCGStab;
        preconditioner  none; 
        tolerance       1e-06;
        relTol          0.1;
        // smoother        GaussSeidel;
    }
    eps_siFinal
    {
        $eps_si;
        tolerance       1e-07;
        relTol          0;
        // smoother nnn;
    }
}

/*
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefCell    0;
    pRefValue    0;
}
*/
PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    nOuterCorrectors  15;

    outerCorrectorResidualControl
    {
        p   
        {
            tolerance  1e-7;
            relTol     0;
        }

    }

}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}


// ************************************************************************* //
